{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting completed branding updates from 'ROOT X GLOBAL' to 'ZINMATT GLOBAL', including changes to hero section, services, taglines, and contact information across multiple frontend components.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components describing the luxury landing page architecture with gold/black theme, including hero, services, portfolio, contact sections and design system details.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using HSL values for luxury black, gold, and UI component styling.",
  "frontend/index.html": "HTML entry point with ZINMATT GLOBAL branding in title and meta description, linking to React app root and favicon.",
  "frontend/src/App.tsx": "Main React application component orchestrating the landing page layout with AnimatedBackground and all section components wrapped in slide-container divs for animations.",
  "frontend/src/components/AboutSection.tsx": "About section component introducing ZINMATT GLOBAL with glassmorphism card displaying five focus areas (Digital Marketing, Social Media Advertising, Business Development, Lead Generation, Branding Strategy) with icons and scroll animations.",
  "frontend/src/components/AnimatedBackground.tsx": "Fixed background component rendering animated geometric shapes (triangles, circles, hexagons), particle overlay, and moving SVG lines with various animation classes for visual depth.",
  "frontend/src/components/ContactSection.tsx": "Contact section displaying phone (7557831531), email (zinmattglobal@gmail.com), and WhatsApp button with gold-accented luxury styling, plus 'Book Private Strategy Call' CTA.",
  "frontend/src/components/CTASection.tsx": "Call-to-action section with gold gradient background, 'Ready To Scale Globally?' headline, and 'Book Strategy Call' button that scrolls to contact section.",
  "frontend/src/components/DifferenceSection.tsx": "Displays a 'Why Choose Us' section with four key advantages (ROI Focused Strategy, Data Driven Execution, Premium Brand Positioning, International Market Expertise) using animated cards with checkmark icons. Uses scroll animation hook for fade-in effects.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with ZINMATT GLOBAL branding, social media links (Facebook, LinkedIn, Instagram), copyright notice, and attribution to caffeine.ai. Features luxury styling with gold accents.",
  "frontend/src/components/HeroSection.tsx": "Main hero section with animated background image carousel, headline 'We Build Global Digital Authority', tagline about premium digital marketing services, and two CTA buttons for consultation and viewing services. Includes scroll indicator animation.",
  "frontend/src/components/PortfolioSection.tsx": "Displays 'Our Impact' section with four achievement cards showing metrics: Brand Authority (50+ brands), Revenue Growth (300% ROI), Lead Generation (10,000+ leads monthly), and Global Reach (25+ countries). Uses icon-based grid layout with hover effects.",
  "frontend/src/components/PowerStatement.tsx": "Full-screen statement section displaying 'We Don't Just Market. We Build Digital Empires.' with animated background elements, gold light streaks, and scroll-triggered scale/fade animations.",
  "frontend/src/components/ProblemSection.tsx": "Empty component file with no content.",
  "frontend/src/components/ServicesSection.tsx": "Displays 'Our Elite Solutions' section with six service cards in a responsive grid: Performance Marketing, Facebook & Instagram Ads, Google Ads Management, High-Converting Funnels, Graphic Design & Branding, and International Business Growth Strategy. Each card features an icon and title with hover effects.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity login state. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for ICP integration, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options for idle handling and derivation origins.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom hook using IntersectionObserver to detect when an element enters the viewport and trigger visibility state changes for scroll-based animations. Returns a ref and isVisible boolean.",
  "frontend/src/index.css": "Global CSS file defining luxury black and gold design system with OKLCH color tokens, custom utility classes for glassmorphism effects, gold gradients, glowing buttons, and premium service card styles using Playfair Display and Inter fonts.",
  "frontend/src/main.tsx": "React application entry point that sets up QueryClient, InternetIdentityProvider, and renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with luxury black/gold colors, custom spacing, gold glow shadows, custom animations (accordion, slow-zoom, scroll-down, pulse-slow), and Playfair Display/Inter font families.",
  "project_state.json": "Project state document defining ZINMATT GLOBAL (formerly ROOT X GLOBAL) as an ultra-luxury corporate landing page with 6 slide-based sections, black/gold design system, glassmorphism effects, and premium digital marketing services including Performance Marketing, Social Media Ads, and International Business Growth Strategy."
}