{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend entry point for the Internet Computer canister.",
  "feature_evidence.json": "Feature evidence report documenting 7 implemented features for the ROOT X GLOBAL landing page redesign, including hero section updates, problem section creation, services section modifications, difference section changes, power statement addition, contact section updates, and about section refinements with high confidence mappings to source files and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the ultra-premium luxury landing page components with gold/black theme, glassmorphism effects, and cinematic animations for ROOT X GLOBAL's marketing and business expansion services.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using oklch color space, including sidebar, chart, and UI component color tokens.",
  "frontend/index.html": "HTML entry point with ROOT X GLOBAL branding, SEO meta description for global logistics and business expansion, and favicon reference to the company logo.",
  "frontend/src/App.tsx": "Main React application component rendering the full landing page with 7 sections (Hero, Problem, Services, Difference, Power Statement, Contact, About) plus Footer, each wrapped in slide-container divs for presentation-style transitions.",
  "frontend/src/components/AboutSection.tsx": "About section component displaying ROOT X GLOBAL's positioning statement in a glassmorphism card with fade-in scroll animation, gold gradient heading, and radial background gradient.",
  "frontend/src/components/ContactSection.tsx": "Contact section with luxury styling displaying phone number (7557831531) and email as clickable links with icons, plus a CTA button for booking strategy calls, all with gold glow effects and scroll animations.",
  "frontend/src/components/DifferenceSection.tsx": "Trust-building section displaying 5 competitive advantages in glassmorphism cards with gold check icons, staggered animations, and 'Why Global Brands Trust Us' headline.",
  "frontend/src/components/Footer.tsx": "Premium footer component with ROOT X GLOBAL branding, social media links (Facebook, LinkedIn, Instagram), copyright notice, and caffeine.ai attribution with UTM tracking parameters.",
  "frontend/src/components/HeroSection.tsx": "Hero section component with rotating background images, animated text, and two CTA buttons (consultation and phone call). Includes scroll indicator and uses scroll animation hook.",
  "frontend/src/components/PowerStatement.tsx": "Full-screen statement section with animated background elements and gold light streaks, displaying a bold brand message with gradient text effects.",
  "frontend/src/components/ProblemSection.tsx": "Displays four business problems in a grid layout with icons (TrendingDown, Eye, AlertCircle, Users) using glassmorphism cards and staggered animations.",
  "frontend/src/components/ServicesSection.tsx": "Grid layout showcasing six elite services with icons (Monitor, Share2, Video, Search, TrendingUp, Users) in hover-animated service cards.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an ICP backend actor, handling both authenticated and anonymous states with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom hook using IntersectionObserver to trigger visibility state when an element scrolls into view with configurable threshold.",
  "frontend/src/index.css": "Global styles with Tailwind configuration, luxury black/gold color system, custom utilities for gradients, glassmorphism effects, service cards, and animation keyframes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom luxury theme including black/gold color palette, OKLCH color system, custom fonts (Playfair Display serif, Inter sans), gold glow shadows, and custom animations (accordion, slow-zoom, scroll-down, pulse-slow).",
  "project_state.json": "Project state document for ROOT X GLOBAL ultra-luxury corporate landing page with black & gold theme, slide-style design, 7 core services (Website Development, Social Media Ads, Video Production, SEO/Branding, Business Strategy, Sales Structuring, Insurance Advisory), and 6 premium presentation slides with cinematic animations."
}