{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Transform ROOT X GLOBAL to ZINMATT GLOBAL ultra-luxury digital agency website",
  "requirements": [
    {
      "id": "REQ-22",
      "summary": "Update all branding from 'ROOT X GLOBAL' to 'ZINMATT GLOBAL' throughout the application",
      "acceptanceCriteria": [
        "HTML title shows 'ZINMATT GLOBAL'",
        "All instances of 'ROOT X GLOBAL' are replaced with 'ZINMATT GLOBAL'",
        "Footer displays '© 2026 ZINMATT GLOBAL. All Rights Reserved.'"
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update page title to 'ZINMATT GLOBAL' and meta description to reflect digital marketing agency positioning with the tagline 'Elevating Brands to Global Authority'"
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Replace all instances of 'ROOT X GLOBAL' with 'ZINMATT GLOBAL' in the company name display and copyright notice, updating to '© 2026 ZINMATT GLOBAL. All Rights Reserved.'"
        },
        {
          "path": "frontend/src/components/AboutSection.tsx",
          "operation": "modify",
          "description": "Replace 'ROOT X GLOBAL' brand references with 'ZINMATT GLOBAL' in the about content"
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Update company tagline to 'Elevating Brands to Global Authority' in footer and meta description",
      "acceptanceCriteria": [
        "Tagline appears in footer below company name",
        "Meta description includes the tagline"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Add tagline 'Elevating Brands to Global Authority' below the ZINMATT GLOBAL company name with subtle gold text styling"
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Include the tagline 'Elevating Brands to Global Authority' in the meta description tag"
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Update hero section headline to 'We Build Global Digital Authority' and subheadline about digital marketing solutions",
      "acceptanceCriteria": [
        "Hero headline displays 'We Build Global Digital Authority'",
        "Hero subheadline displays exact text about digital marketing and business development",
        "Existing motion animation effects are preserved"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HeroSection.tsx",
          "operation": "modify",
          "description": "Update headline to 'We Build Global Digital Authority' and subheadline to 'Premium Digital Marketing, Social Media Ads & Business Development Solutions.' while preserving all existing animation effects and scroll animations"
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Update hero section CTA buttons to 'Get Free Consultation' and 'View Our Services'",
      "acceptanceCriteria": [
        "First button displays 'Get Free Consultation'",
        "Second button displays 'View Our Services'",
        "Buttons retain luxury gold glow effects and existing styling"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HeroSection.tsx",
          "operation": "modify",
          "description": "Update the two CTA buttons to display 'Get Free Consultation' and 'View Our Services' while maintaining the luxury gold glow hover effects and existing button styling"
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Update about section to introduce ZINMATT GLOBAL as a performance-driven digital growth agency",
      "acceptanceCriteria": [
        "About section describes ZINMATT GLOBAL as performance-driven digital growth agency",
        "All five focus areas are clearly presented",
        "Slide-style animation is maintained"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AboutSection.tsx",
          "operation": "modify",
          "description": "Replace the about content to introduce ZINMATT GLOBAL as a performance-driven digital growth agency with focus on Digital Marketing, Social Media Advertising, Business Development, Lead Generation, and Branding Strategy. Preserve glassmorphism card design and fade-in scroll animation"
        }
      ]
    },
    {
      "id": "REQ-27",
      "summary": "Replace services section with 6 new services for digital marketing agency",
      "acceptanceCriteria": [
        "All 6 new services are displayed in service cards",
        "Each service has relevant icon from lucide-react",
        "Gold outline hover effects are preserved",
        "Slide-style card animations are maintained"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ServicesSection.tsx",
          "operation": "modify",
          "description": "Replace the 6 services with: Performance Marketing (TrendingUp icon), Facebook & Instagram Ads (Share2 icon), Google Ads Management (Search icon), High-Converting Funnels (Zap icon), Graphic Design & Branding (Palette icon), and International Business Growth Strategy (Globe icon). Maintain the grid layout, hover animations, and gold outline effects"
        }
      ]
    },
    {
      "id": "REQ-28",
      "summary": "Update 'Why Choose Us' section to display 4 points about ROI, data-driven execution, premium positioning, and international expertise",
      "acceptanceCriteria": [
        "Section displays exactly 4 points with check icons",
        "Black background with glowing golden borders is maintained",
        "All bullet points use the specified text exactly"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DifferenceSection.tsx",
          "operation": "modify",
          "description": "Update the difference section to display exactly 4 points: 'ROI Focused Strategy', 'Data Driven Execution', 'Premium Brand Positioning', and 'International Market Expertise'. Update the section heading to 'Why Choose Us'. Preserve glassmorphism cards, gold check icons, black background with golden borders, and staggered animations"
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Remove the Problem section from the landing page",
      "acceptanceCriteria": [
        "Problem section is no longer rendered in App.tsx",
        "Page flow transitions smoothly from Hero to About/Services"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove the ProblemSection import and component rendering from the page structure. Ensure smooth page flow transitions from Hero to other sections"
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Create portfolio section with sliding gallery layout and luxury hover effects",
      "acceptanceCriteria": [
        "Portfolio section displays between Services and CTA sections",
        "Implements horizontal sliding gallery layout",
        "Portfolio items have gold hover glow effects",
        "Maintains glassmorphism and luxury styling theme"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PortfolioSection.tsx",
          "operation": "create",
          "description": "Create a new portfolio section component with horizontal sliding gallery layout showcasing digital agency projects. Implement gold hover glow effects, glassmorphism design, and smooth horizontal scroll/slide animations. Use scroll animation hook for visibility triggers"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Import and render the new PortfolioSection component between the Services section and the CTA/Contact sections. Wrap it in a slide-container div for consistent section transitions"
        }
      ]
    },
    {
      "id": "REQ-31",
      "summary": "Update CTA section with gold gradient background, 'Ready To Scale Globally?' text, and 'Book Strategy Call' button",
      "acceptanceCriteria": [
        "CTA section has gold gradient background (#D4AF37 to #FFD700)",
        "Displays 'Ready To Scale Globally?' as headline",
        "Button text is 'Book Strategy Call'",
        "Button has luxury styling with hover effects"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CTASection.tsx",
          "operation": "create",
          "description": "Create a new CTA section component with a gold gradient background (from #D4AF37 to #FFD700). Display the headline 'Ready To Scale Globally?' and a luxury-styled button with text 'Book Strategy Call' that has hover glow effects. Position this section before the Contact section"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Import and render the new CTASection component after the Portfolio section and before the Contact section. Wrap it in a slide-container div"
        }
      ]
    },
    {
      "id": "REQ-32",
      "summary": "Update contact section with phone 7557831531, email, and WhatsApp button with gold highlight",
      "acceptanceCriteria": [
        "Contact section displays phone number 7557831531 as clickable link",
        "Email is displayed (zinmattglobal@gmail.com inferred from pattern)",
        "WhatsApp button is added with gold glow highlight effect",
        "Section maintains minimal black background design"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ContactSection.tsx",
          "operation": "modify",
          "description": "Update phone number to 7557831531, update email to zinmattglobal@gmail.com, and add a new WhatsApp button with gold glow highlight effect using lucide-react MessageCircle icon. Maintain minimal black background and existing luxury styling with gold glow effects on all contact links"
        }
      ]
    },
    {
      "id": "REQ-33",
      "summary": "Update power statement section to reflect ZINMATT GLOBAL's digital agency brand message",
      "acceptanceCriteria": [
        "Power statement reflects digital agency positioning",
        "Animated gold light streaks are preserved",
        "Full-screen black background is maintained",
        "Typography uses large gold gradient text"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PowerStatement.tsx",
          "operation": "modify",
          "description": "Update the power statement text to reflect ZINMATT GLOBAL's positioning as a digital marketing authority and growth agency. Preserve all animated background elements, gold light streaks, full-screen black background, and large gold gradient typography effects"
        }
      ]
    },
    {
      "id": "REQ-34",
      "summary": "Add animated background graphics including moving abstract lines, luxury geometric shapes, and soft particles",
      "acceptanceCriteria": [
        "Background contains animated abstract line elements",
        "Geometric shapes animate subtly in the background",
        "Particle effects are visible but not distracting",
        "Animations run smoothly without performance issues"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AnimatedBackground.tsx",
          "operation": "create",
          "description": "Create a new animated background component that renders moving abstract lines, luxury geometric shapes (triangles, circles, hexagons), and soft particle effects. Use CSS animations and transforms for smooth performance. Include opacity controls to keep effects subtle and non-distracting"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Import and render the AnimatedBackground component at the root level of the App component so it displays behind all sections throughout the page"
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add CSS keyframe animations for abstract line movement, geometric shape rotations/translations, and particle floating effects. Ensure animations are smooth and use GPU-accelerated properties (transform, opacity) for performance"
        }
      ]
    },
    {
      "id": "REQ-35",
      "summary": "Update color system to use exact palette: #000000, #0f0f0f, and metallic gold gradient #D4AF37 to #FFD700",
      "acceptanceCriteria": [
        "Primary black is #000000 throughout",
        "Charcoal accent is #0f0f0f",
        "Gold gradients use #D4AF37 to #FFD700 range",
        "All CSS variables and Tailwind config are updated"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update CSS custom properties to use #000000 as primary black (replacing #0B0B0B), #0f0f0f as charcoal accent, and metallic gold gradient from #D4AF37 to #FFD700. Update all color variables throughout the stylesheet"
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Update the custom color palette in the Tailwind config to use #000000 for black, #0f0f0f for charcoal, and the gold gradient range from #D4AF37 to #FFD700. Update any background color definitions and shadow configurations"
        }
      ]
    },
    {
      "id": "REQ-36",
      "summary": "Add social media icons in gold color to footer (Facebook, LinkedIn, Instagram)",
      "acceptanceCriteria": [
        "Footer contains gold-colored social media icons",
        "Icons are clickable and link to social profiles",
        "Icons have hover glow effects matching the luxury theme"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Ensure the existing social media icons (Facebook, LinkedIn, Instagram) are styled with gold color (#D4AF37) and include hover glow effects. Update links to point to ZINMATT GLOBAL social media profiles. Icons should use lucide-react components and match the luxury theme"
        }
      ]
    },
    {
      "id": "REQ-37",
      "summary": "Render generated luxury background images as static assets from frontend/public/assets/generated",
      "acceptanceCriteria": [
        "Background images are loaded from frontend/public/assets/generated directory",
        "Images are displayed as static assets without backend routing",
        "Images enhance the luxury aesthetic across sections"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HeroSection.tsx",
          "operation": "modify",
          "description": "Replace the rotating background images array to reference the generated luxury images: frontend/public/assets/generated/luxury-geometric-bg.dim_1920x1080.png, frontend/public/assets/generated/abstract-gold-lines.dim_1920x1080.png. Load these as static assets using standard img src paths"
        },
        {
          "path": "frontend/src/components/AnimatedBackground.tsx",
          "operation": "modify",
          "description": "Layer the generated particle overlay image frontend/public/assets/generated/gold-particles-overlay.dim_1920x1080.png as a fixed background element with low opacity to create the soft particle effect throughout the page"
        },
        {
          "path": "frontend/src/components/PowerStatement.tsx",
          "operation": "modify",
          "description": "Use the generated abstract gold lines image frontend/public/assets/generated/abstract-gold-lines.dim_1920x1080.png as an animated background layer to enhance the moving line effects in this section"
        }
      ]
    }
  ]
}